class College < HashModel::Grouped
  
  def self.data
    # {
    #   university_id => [
    #     {:id => college_id, :name => college_name}
    #   ]
    # }
    
    {
      100100 => [
        {:id => 100100, :name => "求职学院"},
        {:id => 100200, :name => "销售学院"}
      ],
      
      
      100200 => [
        {:id => 100300, :name => "经济管理学院"},
        {:id => 100400, :name => "人文学院"},
        {:id => 100500, :name => "信息学院"},
        {:id => 100600, :name => "国际文化交流学院"},
        {:id => 100700, :name => "外国语学院"},
        {:id => 100800, :name => "工程学院"},
        {:id => 100900, :name => "成人教育学院"},
        {:id => 101000, :name => "海洋学院"},
        {:id => 101100, :name => "爱恩学院"},
        {:id => 101200, :name => "生命科学与技术学院"},
        {:id => 101300, :name => "食品学院"},
        {:id => 101400, :name => "高等职业技术学院"},
        {:id => 101500, :name => "其它院系"}
      ],
      
      
      100300 => [
        {:id => 101600, :name => "交大密西根联合学院"},
        {:id => 101700, :name => "人文学院"},
        {:id => 101800, :name => "体育系"},
        {:id => 101900, :name => "信息安全工程学院"},
        {:id => 102000, :name => "农业与生物学院"},
        {:id => 102100, :name => "化学化工学院"},
        {:id => 102200, :name => "医学院"},
        {:id => 102300, :name => "医学院卫生技术学院"},
        {:id => 102400, :name => "嘉兴南洋学院"},
        {:id => 102500, :name => "国际与公共事务学院"},
        {:id => 102600, :name => "国际贸易"},
        {:id => 102700, :name => "塑性成形工程系"},
        {:id => 102800, :name => "外国语学院"},
        {:id => 102900, :name => "媒体与设计学院"},
        {:id => 103000, :name => "安泰经济与管理学院"},
        {:id => 103100, :name => "工商管理"},
        {:id => 103200, :name => "建筑系"},
        {:id => 103300, :name => "微电子学院"},
        {:id => 103400, :name => "微纳科学技术研究院"},
        {:id => 103500, :name => "思源学院"},
        {:id => 103600, :name => "成人教育学院"},
        {:id => 103700, :name => "技术学院"},
        {:id => 103800, :name => "护理学院"},
        {:id => 103900, :name => "机械与动力工程学院"},
        {:id => 104000, :name => "材料科学与工程学院"},
        {:id => 104100, :name => "核科学与工程学院"},
        {:id => 104200, :name => "法学院"},
        {:id => 104300, :name => "海外教育学院"},
        {:id => 104400, :name => "环境科学与工程学院"},
        {:id => 104500, :name => "理学院数学系"},
        {:id => 104600, :name => "理学院物理系"},
        {:id => 104700, :name => "生命科学技术学院"},
        {:id => 104800, :name => "生物医学工程"},
        {:id => 104900, :name => "电子信息与电气工程学院"},
        {:id => 105000, :name => "空天科学技术研究院"},
        {:id => 105100, :name => "网络教育学院"},
        {:id => 105200, :name => "联合学院"},
        {:id => 105300, :name => "联读班"},
        {:id => 105400, :name => "船舶海洋与建筑工程学院"},
        {:id => 105500, :name => "药学院"},
        {:id => 105600, :name => "计算机科学与技术"},
        {:id => 105700, :name => "软件学院"},
        {:id => 105800, :name => "其它院系"}
      ],
      
      
      100400 => [
        {:id => 105900, :name => "上海医学院"},
        {:id => 106000, :name => "世界经济系"},
        {:id => 106100, :name => "中国语言文学系"},
        {:id => 106200, :name => "中法物流管理"},
        {:id => 106300, :name => "企业管理系"},
        {:id => 106400, :name => "传播学系"},
        {:id => 106500, :name => "保险系"},
        {:id => 106600, :name => "信息管理与信息系统系"},
        {:id => 106700, :name => "光源与照明工程系"},
        {:id => 106800, :name => "光科学与工程系"},
        {:id => 106900, :name => "公共卫生学院"},
        {:id => 107000, :name => "公共经济学系"},
        {:id => 107100, :name => "公共行政系"},
        {:id => 107200, :name => "内科学系"},
        {:id => 107300, :name => "力学与工程科学系"},
        {:id => 107400, :name => "化学系"},
        {:id => 107500, :name => "历史学系"},
        {:id => 107600, :name => "哲学系"},
        {:id => 107700, :name => "国际关系与公共事务学院"},
        {:id => 107800, :name => "国际政治系"},
        {:id => 107900, :name => "国际经济与贸易"},
        {:id => 108000, :name => "国际金融系"},
        {:id => 108100, :name => "复旦大学继续教育学院"},
        {:id => 108200, :name => "外文学院"},
        {:id => 108300, :name => "外科学系"},
        {:id => 108400, :name => "太平洋金融学院"},
        {:id => 108500, :name => "市场营销系"},
        {:id => 108600, :name => "广告系"},
        {:id => 108700, :name => "广播电视新闻系"},
        {:id => 108800, :name => "微电子学系"},
        {:id => 108900, :name => "微电子研究院"},
        {:id => 109000, :name => "心理学系"},
        {:id => 109100, :name => "护理学院"},
        {:id => 109200, :name => "政治学系"},
        {:id => 109300, :name => "数学科学学院"},
        {:id => 109400, :name => "文物和博物馆学系"},
        {:id => 109500, :name => "新闻学系"},
        {:id => 109600, :name => "旅游系"},
        {:id => 109700, :name => "日语语言文学"},
        {:id => 109800, :name => "材料科学系"},
        {:id => 109900, :name => "法医学系"},
        {:id => 110000, :name => "法学院"},
        {:id => 110100, :name => "物理学系"},
        {:id => 110200, :name => "环境科学与工程系"},
        {:id => 110300, :name => "生命科学学院"},
        {:id => 110400, :name => "生态与进化生物学系"},
        {:id => 110500, :name => "生物化学与分子生物系"},
        {:id => 110600, :name => "生物医学研究院"},
        {:id => 110700, :name => "生理学与生物物理系"},
        {:id => 110800, :name => "电子信息科学与技术"},
        {:id => 110900, :name => "电子工程系"},
        {:id => 111000, :name => "病理学系"},
        {:id => 111100, :name => "社会发展与公共政策学院"},
        {:id => 111200, :name => "社会科学基础部"},
        {:id => 111300, :name => "神经生物学系"},
        {:id => 111400, :name => "第二军医大学"},
        {:id => 111500, :name => "管理学院"},
        {:id => 111600, :name => "管理科学系"},
        {:id => 111700, :name => "细胞与遗传医学系"},
        {:id => 111800, :name => "经济学系"},
        {:id => 111900, :name => "统计学系"},
        {:id => 112000, :name => "网络学院"},
        {:id => 112100, :name => "网络教育学院"},
        {:id => 112200, :name => "艺术系"},
        {:id => 112300, :name => "英语语言文学"},
        {:id => 112400, :name => "药学院"},
        {:id => 112500, :name => "计算机与信息技术系"},
        {:id => 112600, :name => "计算机科学与工程系"},
        {:id => 112700, :name => "财务金融系"},
        {:id => 112800, :name => "软件学院"},
        {:id => 112900, :name => "通信科学与工程系"},
        {:id => 113000, :name => "遗传学和遗传工程系"},
        {:id => 113100, :name => "高分子科学系"},
        {:id => 113200, :name => "其它院系"}
      ],
      
      
      100500 => [
        {:id => 113300, :name => "CDHK"},
        {:id => 113400, :name => "CIMS中心"},
        {:id => 113500, :name => "中国语言文学系"},
        {:id => 113600, :name => "中德工程学院"},
        {:id => 113700, :name => "中德职教学院"},
        {:id => 113800, :name => "中德职教机械"},
        {:id => 113900, :name => "临床医学"},
        {:id => 114000, :name => "临床医学一系"},
        {:id => 114100, :name => "临床医学二系"},
        {:id => 114200, :name => "交通工程"},
        {:id => 114300, :name => "交通运输工程学院"},
        {:id => 114400, :name => "人文学院"},
        {:id => 114500, :name => "传播与艺术学院"},
        {:id => 114600, :name => "体育教学部"},
        {:id => 114700, :name => "信息与通信工程系"},
        {:id => 114800, :name => "化学系"},
        {:id => 114900, :name => "口腔医学院"},
        {:id => 115000, :name => "同科学院"},
        {:id => 115100, :name => "哲学与社会学系"},
        {:id => 115200, :name => "国际政治研究所"},
        {:id => 115300, :name => "国际贸易"},
        {:id => 115400, :name => "土木工程学院"},
        {:id => 115500, :name => "地球信息科学与技术系"},
        {:id => 115600, :name => "地球物理系"},
        {:id => 115700, :name => "城市规划系"},
        {:id => 115800, :name => "基础医学院"},
        {:id => 115900, :name => "声学研究所"},
        {:id => 116000, :name => "女子学院"},
        {:id => 116100, :name => "工业设计系"},
        {:id => 116200, :name => "工商管理"},
        {:id => 116300, :name => "应用数学系"},
        {:id => 116400, :name => "建筑与城市规划学院"},
        {:id => 116500, :name => "建筑环境与设备工程"},
        {:id => 116600, :name => "建筑系"},
        {:id => 116700, :name => "建设管理与房地产系"},
        {:id => 116800, :name => "德语系"},
        {:id => 116900, :name => "控制科学与工程系院"},
        {:id => 117000, :name => "政治学与行政学系"},
        {:id => 117100, :name => "教育技术与计算中心"},
        {:id => 117200, :name => "数字艺术系"},
        {:id => 117300, :name => "文法学院"},
        {:id => 117400, :name => "日语系"},
        {:id => 117500, :name => "景观系"},
        {:id => 117600, :name => "机械工程学院"},
        {:id => 117700, :name => "材料科学与工程学院"},
        {:id => 117800, :name => "汽车学院"},
        {:id => 117900, :name => "沪西学院"},
        {:id => 118000, :name => "法律学系"},
        {:id => 118100, :name => "法政学院"},
        {:id => 118200, :name => "海洋地质系"},
        {:id => 118300, :name => "澳洲高等技术学院"},
        {:id => 118400, :name => "物流管理"},
        {:id => 118500, :name => "物理系"},
        {:id => 118600, :name => "环境科学与工程学院"},
        {:id => 118700, :name => "理论经济学系"},
        {:id => 118800, :name => "生命科学与技术学院"},
        {:id => 118900, :name => "电信学院"},
        {:id => 119000, :name => "电子信息工程"},
        {:id => 119100, :name => "电子科学与技术系"},
        {:id => 119200, :name => "电影学院"},
        {:id => 119300, :name => "电气信息类"},
        {:id => 119400, :name => "电气工程系"},
        {:id => 119500, :name => "留德预备部"},
        {:id => 119600, :name => "知识产权学院"},
        {:id => 119700, :name => "神学院"},
        {:id => 119800, :name => "经济与管理学院"},
        {:id => 119900, :name => "继续教育学院"},
        {:id => 120000, :name => "网络学院"},
        {:id => 120100, :name => "职业技术教育学院"},
        {:id => 120200, :name => "联邦德国研究所"},
        {:id => 120300, :name => "航空航天与力学学院"},
        {:id => 120400, :name => "艺术设计系"},
        {:id => 120500, :name => "英语系"},
        {:id => 120600, :name => "计算机科学与技术系"},
        {:id => 120700, :name => "软件学院"},
        {:id => 120800, :name => "铁道与城市轨道交通研究院"},
        {:id => 120900, :name => "高等技术学院"},
        {:id => 121000, :name => "其它院系"}
      ],
      
      
      100600 => [
        {:id => 121100, :name => "东方房地产学院"},
        {:id => 121200, :name => "中国语言文学系"},
        {:id => 121300, :name => "中澳班"},
        {:id => 121400, :name => "人文社会科学学院"},
        {:id => 121500, :name => "传播学院"},
        {:id => 121600, :name => "体育学系"},
        {:id => 121700, :name => "俄语系"},
        {:id => 121800, :name => "信息学院"},
        {:id => 121900, :name => "光华学院经济学系"},
        {:id => 122000, :name => "公共管理学院"},
        {:id => 122100, :name => "化学系"},
        {:id => 122200, :name => "华光学院"},
        {:id => 122300, :name => "历史学系"},
        {:id => 122400, :name => "哲学系"},
        {:id => 122500, :name => "商学院信息学系"},
        {:id => 122600, :name => "商学院经济系"},
        {:id => 122700, :name => "国际关系与地区发展研究院"},
        {:id => 122800, :name => "地理学系"},
        {:id => 122900, :name => "城市与区域经济系"},
        {:id => 123000, :name => "大学外语部"},
        {:id => 123100, :name => "学前教育学系"},
        {:id => 123200, :name => "对外汉语系"},
        {:id => 123300, :name => "对外汉语远程教学中心"},
        {:id => 123400, :name => "工商管理系"},
        {:id => 123500, :name => "德语系"},
        {:id => 123600, :name => "心理学系"},
        {:id => 123700, :name => "教育信息技术系"},
        {:id => 123800, :name => "教育管理系华夏学院"},
        {:id => 123900, :name => "教育系"},
        {:id => 124000, :name => "数学系"},
        {:id => 124100, :name => "旅游学系"},
        {:id => 124200, :name => "日语系"},
        {:id => 124300, :name => "欧洲语言系"},
        {:id => 124400, :name => "汉语言系"},
        {:id => 124500, :name => "河口海岸科学研究院"},
        {:id => 124600, :name => "法政学院"},
        {:id => 124700, :name => "法语系"},
        {:id => 124800, :name => "物理学系"},
        {:id => 124900, :name => "特殊教育学系"},
        {:id => 125000, :name => "环境科学与技术系"},
        {:id => 125100, :name => "理工学院"},
        {:id => 125200, :name => "生物学系"},
        {:id => 125300, :name => "电子商务"},
        {:id => 125400, :name => "电子科学技术系"},
        {:id => 125500, :name => "社会主义阵营"},
        {:id => 125600, :name => "社会科学部"},
        {:id => 125700, :name => "统计学系"},
        {:id => 125800, :name => "继续教育学院"},
        {:id => 125900, :name => "网络教育学院"},
        {:id => 126000, :name => "职业技术学院"},
        {:id => 126100, :name => "艺术学院"},
        {:id => 126200, :name => "艺术教育系"},
        {:id => 126300, :name => "英语系"},
        {:id => 126400, :name => "计算中心"},
        {:id => 126500, :name => "计算机科学与技术系"},
        {:id => 126600, :name => "设计学院"},
        {:id => 126700, :name => "课程与教学系"},
        {:id => 126800, :name => "资环学院"},
        {:id => 126900, :name => "软件学院"},
        {:id => 127000, :name => "金融学系"},
        {:id => 127100, :name => "预科"},
        {:id => 127200, :name => "高等教育研究所"},
        {:id => 127300, :name => "其它院系"}
      ],
      
      
      100700 => [
        {:id => 127400, :name => "东方房地产学院"},
        {:id => 127500, :name => "中国语言文学系"},
        {:id => 127600, :name => "中澳班"},
        {:id => 127700, :name => "人文社会科学学院"},
        {:id => 127800, :name => "传播学院"},
        {:id => 127900, :name => "体育学系"},
        {:id => 128000, :name => "俄语系"},
        {:id => 128100, :name => "信息学院"},
        {:id => 128200, :name => "光华学院经济学系"},
        {:id => 128300, :name => "公共管理学院"},
        {:id => 128400, :name => "化学系"},
        {:id => 128500, :name => "华光学院"},
        {:id => 128600, :name => "历史学系"},
        {:id => 128700, :name => "哲学系"},
        {:id => 128800, :name => "商学院信息学系"},
        {:id => 128900, :name => "商学院经济系"},
        {:id => 129000, :name => "国际关系与地区发展研究院"},
        {:id => 129100, :name => "地理学系"},
        {:id => 129200, :name => "城市与区域经济系"},
        {:id => 129300, :name => "大学外语部"},
        {:id => 129400, :name => "学前教育学系"},
        {:id => 129500, :name => "对外汉语系"},
        {:id => 129600, :name => "对外汉语远程教学中心"},
        {:id => 129700, :name => "工商管理系"},
        {:id => 129800, :name => "德语系"},
        {:id => 129900, :name => "心理学系"},
        {:id => 130000, :name => "教育信息技术系"},
        {:id => 130100, :name => "教育管理系华夏学院"},
        {:id => 130200, :name => "教育系"},
        {:id => 130300, :name => "数学系"},
        {:id => 130400, :name => "旅游学系"},
        {:id => 130500, :name => "日语系"},
        {:id => 130600, :name => "欧洲语言系"},
        {:id => 130700, :name => "汉语言系"},
        {:id => 130800, :name => "河口海岸科学研究院"},
        {:id => 130900, :name => "法政学院"},
        {:id => 131000, :name => "法语系"},
        {:id => 131100, :name => "物理学系"},
        {:id => 131200, :name => "特殊教育学系"},
        {:id => 131300, :name => "环境科学与技术系"},
        {:id => 131400, :name => "理工学院"},
        {:id => 131500, :name => "生物学系"},
        {:id => 131600, :name => "电子商务"},
        {:id => 131700, :name => "电子科学技术系"},
        {:id => 131800, :name => "社会主义阵营"},
        {:id => 131900, :name => "社会科学部"},
        {:id => 132000, :name => "统计学系"},
        {:id => 132100, :name => "继续教育学院"},
        {:id => 132200, :name => "网络教育学院"},
        {:id => 132300, :name => "职业技术学院"},
        {:id => 132400, :name => "艺术学院"},
        {:id => 132500, :name => "艺术教育系"},
        {:id => 132600, :name => "英语系"},
        {:id => 132700, :name => "计算中心"},
        {:id => 132800, :name => "计算机科学与技术系"},
        {:id => 132900, :name => "设计学院"},
        {:id => 133000, :name => "课程与教学系"},
        {:id => 133100, :name => "资环学院"},
        {:id => 133200, :name => "软件学院"},
        {:id => 133300, :name => "金融学系"},
        {:id => 133400, :name => "预科"},
        {:id => 133500, :name => "高等教育研究所"},
        {:id => 133600, :name => "其它院系"}
      ],
      
      
      100800 => [
        {:id => 133700, :name => "中德工学院"},
        {:id => 133800, :name => "人文科学研究院"},
        {:id => 133900, :name => "体育系"},
        {:id => 134000, :name => "信息科学与工程学院"},
        {:id => 134100, :name => "化学与分子工程学院"},
        {:id => 134200, :name => "化工学院"},
        {:id => 134300, :name => "商学院"},
        {:id => 134400, :name => "国际教育学院"},
        {:id => 134500, :name => "国际经济与贸易"},
        {:id => 134600, :name => "外国语学院"},
        {:id => 134700, :name => "旅游管理"},
        {:id => 134800, :name => "机械与动力工程学院"},
        {:id => 134900, :name => "材料科学与工程学院"},
        {:id => 135000, :name => "法学院"},
        {:id => 135100, :name => "理学院"},
        {:id => 135200, :name => "理工优秀生部"},
        {:id => 135300, :name => "生物工程学院"},
        {:id => 135400, :name => "石油化工学院"},
        {:id => 135500, :name => "研究生院"},
        {:id => 135600, :name => "社会与公共管理学院"},
        {:id => 135700, :name => "继续教育学院"},
        {:id => 135800, :name => "网络教育学院"},
        {:id => 135900, :name => "艺术设计与传媒学院"},
        {:id => 136000, :name => "药学院"},
        {:id => 136100, :name => "计算机科学与技术"},
        {:id => 136200, :name => "资源与环境工程学院"},
        {:id => 136300, :name => "软件与信息管理学院"},
        {:id => 136400, :name => "其它院系"}
      ],
      
      
      100900 => [
        {:id => 136500, :name => "上海商学院"},
        {:id => 136600, :name => "国际交流学院"},
        {:id => 136700, :name => "国际经济贸易系"},
        {:id => 136800, :name => "外语学院"},
        {:id => 136900, :name => "成人教育学院"},
        {:id => 137000, :name => "新闻传播学院"},
        {:id => 137100, :name => "法律行政系"},
        {:id => 137200, :name => "生态旅游学院"},
        {:id => 137300, :name => "管理学院"},
        {:id => 137400, :name => "艺术设计学院"},
        {:id => 137500, :name => "计算机与电子工程学院"},
        {:id => 137600, :name => "财会金融学院"},
        {:id => 137700, :name => "食品工艺技术系"},
        {:id => 137800, :name => "其它院系"}
      ],
      
      
      101000 => [
        {:id => 137900, :name => "人文学院"},
        {:id => 138000, :name => "体育部"},
        {:id => 138100, :name => "信息科学与技术学院"},
        {:id => 138200, :name => "化学与化工学院"},
        {:id => 138300, :name => "国际文化交流学院"},
        {:id => 138400, :name => "外语学院"},
        {:id => 138500, :name => "成人教育学院"},
        {:id => 138600, :name => "拉萨尔国际设计学院"},
        {:id => 138700, :name => "旅游系"},
        {:id => 138800, :name => "旭日工商管理学院"},
        {:id => 138900, :name => "服装学院"},
        {:id => 139000, :name => "机械工程学院"},
        {:id => 139100, :name => "环境科学与工程学院"},
        {:id => 139200, :name => "理学院"},
        {:id => 139300, :name => "理科试验班"},
        {:id => 139400, :name => "纺织学院"},
        {:id => 139500, :name => "网络教育学院"},
        {:id => 139600, :name => "职业技术学院"},
        {:id => 139700, :name => "计算机科学与技术学院"},
        {:id => 139800, :name => "其它院系"}
      ],
      
      
      101100 => [
        {:id => 139900, :name => "中德学院"},
        {:id => 140000, :name => "中英国际学院"},
        {:id => 140100, :name => "光学与电子信息工程学院"},
        {:id => 140200, :name => "出版印刷学院"},
        {:id => 140300, :name => "动力工程学院"},
        {:id => 140400, :name => "医疗器械学院"},
        {:id => 140500, :name => "商学院"},
        {:id => 140600, :name => "城市建设与环境工程学院"},
        {:id => 140700, :name => "基础学院"},
        {:id => 140800, :name => "外语学院"},
        {:id => 140900, :name => "机械工程学院"},
        {:id => 141000, :name => "理学院"},
        {:id => 141100, :name => "电气工程学院"},
        {:id => 141200, :name => "管理学院"},
        {:id => 141300, :name => "继续教育学院"},
        {:id => 141400, :name => "艺术设计学院"},
        {:id => 141500, :name => "计算机工程学院"},
        {:id => 141600, :name => "高等职业技术学院"},
        {:id => 141700, :name => "其它院系"}
      ],
      
      
      101200 => [
        {:id => 141800, :name => "中欧工程技术学院"},
        {:id => 141900, :name => "国际工商管理学院"},
        {:id => 142000, :name => "土木工程系"},
        {:id => 142100, :name => "基础教学强化班"},
        {:id => 142200, :name => "外国语学院"},
        {:id => 142300, :name => "工商管理"},
        {:id => 142400, :name => "巴士汽车学院"},
        {:id => 142500, :name => "广告系"},
        {:id => 142600, :name => "影视艺术技术学院"},
        {:id => 142700, :name => "微电子中心"},
        {:id => 142800, :name => "悉尼工商与管理学院"},
        {:id => 142900, :name => "房地产学院"},
        {:id => 143000, :name => "数码艺术学院"},
        {:id => 143100, :name => "文学院"},
        {:id => 143200, :name => "机电工程与自动化学院"},
        {:id => 143300, :name => "材料科学与工程学院"},
        {:id => 143400, :name => "法学院"},
        {:id => 143500, :name => "海洋学院"},
        {:id => 143600, :name => "环境与化学工程学院"},
        {:id => 143700, :name => "理学院"},
        {:id => 143800, :name => "理学院数学系"},
        {:id => 143900, :name => "生命科学学院"},
        {:id => 144000, :name => "社会学"},
        {:id => 144100, :name => "社会科学学院"},
        {:id => 144200, :name => "纳米中心"},
        {:id => 144300, :name => "经济管理系"},
        {:id => 144400, :name => "美术学院"},
        {:id => 144500, :name => "自强学院"},
        {:id => 144600, :name => "计算机工程与科学学院"},
        {:id => 144700, :name => "通信与信息工程学院"},
        {:id => 144800, :name => "食品学院"},
        {:id => 144900, :name => "高等技术学院"},
        {:id => 145000, :name => "其它院系"}
      ],
      
      
      101300 => [
        {:id => 145100, :name => "东方语学院"},
        {:id => 145200, :name => "俄语系"},
        {:id => 145300, :name => "出国培训部"},
        {:id => 145400, :name => "国际工商管理学院"},
        {:id => 145500, :name => "国际教育学院"},
        {:id => 145600, :name => "国际文化交流学院"},
        {:id => 145700, :name => "国际金融贸易学院"},
        {:id => 145800, :name => "德语系"},
        {:id => 145900, :name => "新闻传播学院"},
        {:id => 146000, :name => "日本文化经济学院"},
        {:id => 146100, :name => "法学院"},
        {:id => 146200, :name => "法语系"},
        {:id => 146300, :name => "海外合作学院"},
        {:id => 146400, :name => "研究生部"},
        {:id => 146500, :name => "立泰语言文化学院"},
        {:id => 146600, :name => "继续教育学院"},
        {:id => 146700, :name => "网络学院"},
        {:id => 146800, :name => "英语学院"},
        {:id => 146900, :name => "西方语系"},
        {:id => 147000, :name => "贤达经济人文学院"},
        {:id => 147100, :name => "高等职业教育技术学院"},
        {:id => 147200, :name => "高级翻译学院"},
        {:id => 147300, :name => "其它院系"}
      ],
      
      
      101400 => [
        {:id => 147400, :name => "交通运输学院"},
        {:id => 147500, :name => "信息工程学院"},
        {:id => 147600, :name => "商船学院"},
        {:id => 147700, :name => "基础教学部"},
        {:id => 147800, :name => "外国语学院"},
        {:id => 147900, :name => "明华-上海海事大学深圳进修学院"},
        {:id => 148000, :name => "浦东工商管理学院"},
        {:id => 148100, :name => "海华高等技术学院"},
        {:id => 148200, :name => "海洋环境与安全工程学院"},
        {:id => 148300, :name => "物流工程学院"},
        {:id => 148400, :name => "经济管理学院"},
        {:id => 148500, :name => "继续教育学院"},
        {:id => 148600, :name => "航海系"},
        {:id => 148700, :name => "轮机工程"},
        {:id => 148800, :name => "高等技术学院"},
        {:id => 148900, :name => "其它院系"}
      ],
      
      
      101500 => [
        {:id => 149000, :name => "上海市高级技工学院"},
        {:id => 149100, :name => "体育教学部"},
        {:id => 149200, :name => "化学化工学院"},
        {:id => 149300, :name => "城市轨道交通学院"},
        {:id => 149400, :name => "基础教学学院"},
        {:id => 149500, :name => "成人教育学院"},
        {:id => 149600, :name => "服装学院"},
        {:id => 149700, :name => "机械工程学院"},
        {:id => 149800, :name => "材料工程学院"},
        {:id => 149900, :name => "汽车工程学院"},
        {:id => 150000, :name => "电子电气工程学院"},
        {:id => 150100, :name => "社会科学教育部"},
        {:id => 150200, :name => "管理学院"},
        {:id => 150300, :name => "航空运输学院"},
        {:id => 150400, :name => "艺术设计学院"},
        {:id => 150500, :name => "其它院系"}
      ],
      
      
      101600 => [
        {:id => 150600, :name => "中药学院"},
        {:id => 150700, :name => "医技学院"},
        {:id => 150800, :name => "国际教育学院"},
        {:id => 150900, :name => "基础医学院"},
        {:id => 151000, :name => "岳阳临床医学院"},
        {:id => 151100, :name => "护理学院"},
        {:id => 151200, :name => "曙光临床医学院"},
        {:id => 151300, :name => "研究生院"},
        {:id => 151400, :name => "社科部"},
        {:id => 151500, :name => "继续教育学院"},
        {:id => 151600, :name => "运动医学"},
        {:id => 151700, :name => "针推学院"},
        {:id => 151800, :name => "龙华临床医学院"},
        {:id => 151900, :name => "其它院系"}
      ],
      
      
      101700 => [
        {:id => 152000, :name => "人文与传播学院"},
        {:id => 152100, :name => "体育学院"},
        {:id => 152200, :name => "商学院"},
        {:id => 152300, :name => "外国语学院"},
        {:id => 152400, :name => "天华学院"},
        {:id => 152500, :name => "女子文化学院"},
        {:id => 152600, :name => "对外汉语学院"},
        {:id => 152700, :name => "广告系"},
        {:id => 152800, :name => "建筑工程学院"},
        {:id => 152900, :name => "教育科学学院"},
        {:id => 153000, :name => "数理信息学院"},
        {:id => 153100, :name => "旅游学院"},
        {:id => 153200, :name => "机械与电子工程学院"},
        {:id => 153300, :name => "欧洲文化与商务学院"},
        {:id => 153400, :name => "法政学院"},
        {:id => 153500, :name => "犹他科技学院"},
        {:id => 153600, :name => "生命与环境学院"},
        {:id => 153700, :name => "美术学院"},
        {:id => 153800, :name => "行政学院"},
        {:id => 153900, :name => "谢晋影视艺术学院"},
        {:id => 154000, :name => "金融学院"},
        {:id => 154100, :name => "音乐学院"},
        {:id => 154200, :name => "其它院系"}
      ],
      
      
      101800 => [
        {:id => 154300, :name => "信息技术系"},
        {:id => 154400, :name => "商贸系"},
        {:id => 154500, :name => "外语系"},
        {:id => 154600, :name => "文化传播系"},
        {:id => 154700, :name => "机电工程系"},
        {:id => 154800, :name => "管理系"},
        {:id => 154900, :name => "艺术设计系"},
        {:id => 155000, :name => "其它院系"}
      ],
      
      
      101900 => [
        {:id => 155100, :name => "刑事司法系"},
        {:id => 155200, :name => "国际法商系"},
        {:id => 155300, :name => "外语系"},
        {:id => 155400, :name => "政治学与行政管理系"},
        {:id => 155500, :name => "法律系"},
        {:id => 155600, :name => "社会学与社会工作系"},
        {:id => 155700, :name => "社科系"},
        {:id => 155800, :name => "经济法系"},
        {:id => 155900, :name => "经济管理系"},
        {:id => 156000, :name => "其它院系"}
      ],
      
      
      102000 => [
        {:id => 156100, :name => "国际教育学院"},
        {:id => 156200, :name => "外语学院"},
        {:id => 156300, :name => "文理学院"},
        {:id => 156400, :name => "机械学院"},
        {:id => 156500, :name => "李斌技师学院"},
        {:id => 156600, :name => "汽车工程系"},
        {:id => 156700, :name => "电子信息学院"},
        {:id => 156800, :name => "电气学院"},
        {:id => 156900, :name => "经济管理学院"},
        {:id => 157000, :name => "继续教育学院"},
        {:id => 157100, :name => "其它院系"}
      ],
      
      
      102100 => [
        {:id => 157200, :name => "人文学院"},
        {:id => 157300, :name => "体育部"},
        {:id => 157400, :name => "国际交流学院"},
        {:id => 157500, :name => "外国语学院"},
        {:id => 157600, :name => "应用艺术设计系"},
        {:id => 157700, :name => "建筑工程"},
        {:id => 157800, :name => "成人与继续教育学院"},
        {:id => 157900, :name => "机电工程学院"},
        {:id => 158000, :name => "环境工程系"},
        {:id => 158100, :name => "理学院"},
        {:id => 158200, :name => "电子与电气工程学院"},
        {:id => 158300, :name => "经济管理学院"},
        {:id => 158400, :name => "计算机与信息学院"},
        {:id => 158500, :name => "其它院系"}
      ],
      
      
      102200 => [
        {:id => 158600, :name => "体育教育部"},
        {:id => 158700, :name => "化学工程系"},
        {:id => 158800, :name => "土木与建筑工程系"},
        {:id => 158900, :name => "外语系"},
        {:id => 159000, :name => "数理教学部"},
        {:id => 159100, :name => "机械与自动化工程学院"},
        {:id => 159200, :name => "材料工程系"},
        {:id => 159300, :name => "环境与能源工程系"},
        {:id => 159400, :name => "生物与食品工程系"},
        {:id => 159500, :name => "社会科学系"},
        {:id => 159600, :name => "经济与管理工程系"},
        {:id => 159700, :name => "艺术设计系"},
        {:id => 159800, :name => "计算机科学与信息工程系"},
        {:id => 159900, :name => "香精香料技术与工程学院"},
        {:id => 160000, :name => "高职学院"},
        {:id => 160100, :name => "其它院系"}
      ],
      
      
      102300 => [
        {:id => 160200, :name => "信息与控制工程系"},
        {:id => 160300, :name => "动力工程系"},
        {:id => 160400, :name => "国际交流学院"},
        {:id => 160500, :name => "外语系"},
        {:id => 160600, :name => "成人教育学院"},
        {:id => 160700, :name => "数理系"},
        {:id => 160800, :name => "环境工程系"},
        {:id => 160900, :name => "现代教育技术中心"},
        {:id => 161000, :name => "电力与自动化工程学院"},
        {:id => 161100, :name => "电力工程系"},
        {:id => 161200, :name => "电子与信息工程系"},
        {:id => 161300, :name => "社会科学系"},
        {:id => 161400, :name => "管理与人文学院"},
        {:id => 161500, :name => "经济管理系"},
        {:id => 161600, :name => "能源与环境工程学院"},
        {:id => 161700, :name => "计算机与信息工程学院"},
        {:id => 161800, :name => "计算机及通讯工程系"},
        {:id => 161900, :name => "高职学院"},
        {:id => 162000, :name => "其它院系"}
      ],
      
      
      102400 => [
        {:id => 162100, :name => "WTO研究教育学院"},
        {:id => 162200, :name => "加州英语和商务学院"},
        {:id => 162300, :name => "商务外语学院"},
        {:id => 162400, :name => "国际交流学院"},
        {:id => 162500, :name => "国际经贸学院"},
        {:id => 162600, :name => "国际经贸研究所"},
        {:id => 162700, :name => "基础部"},
        {:id => 162800, :name => "成人教育学院"},
        {:id => 162900, :name => "教育技术部"},
        {:id => 163000, :name => "法学院"},
        {:id => 163100, :name => "澳曼特国际商学院"},
        {:id => 163200, :name => "研究生部"},
        {:id => 163300, :name => "金融管理学院"},
        {:id => 163400, :name => "其它院系"}
      ],
      
      
      102500 => [
        {:id => 163500, :name => "人文艺术系"},
        {:id => 163600, :name => "会计学院"},
        {:id => 163700, :name => "体育教学部"},
        {:id => 163800, :name => "保险系"},
        {:id => 163900, :name => "信息管理系"},
        {:id => 164000, :name => "国际教学部"},
        {:id => 164100, :name => "国际贸易系"},
        {:id => 164200, :name => "国际金融保险学院"},
        {:id => 164300, :name => "外语系"},
        {:id => 164400, :name => "工商管理系"},
        {:id => 164500, :name => "应用数学系"},
        {:id => 164600, :name => "社会科学教学部"},
        {:id => 164700, :name => "经济系"},
        {:id => 164800, :name => "财政系"},
        {:id => 164900, :name => "金融系"},
        {:id => 165000, :name => "其它院系"}
      ],
      
      
      102600 => [
        {:id => 165100, :name => "人文社会科学教学部"},
        {:id => 165200, :name => "会计学系"},
        {:id => 165300, :name => "体育教学部"},
        {:id => 165400, :name => "信息科学系"},
        {:id => 165500, :name => "国际贸易与经济系"},
        {:id => 165600, :name => "外语系"},
        {:id => 165700, :name => "大专部"},
        {:id => 165800, :name => "审计学系"},
        {:id => 165900, :name => "工商管理系"},
        {:id => 166000, :name => "数学与统计系"},
        {:id => 166100, :name => "法律系"},
        {:id => 166200, :name => "涉外会计"},
        {:id => 166300, :name => "财务管理系"},
        {:id => 166400, :name => "财政与税务系"},
        {:id => 166500, :name => "金融系"},
        {:id => 166600, :name => "其它院系"}
      ],
      
      
      102700 => [
        {:id => 166700, :name => "体育教育学院"},
        {:id => 166800, :name => "体育新闻系"},
        {:id => 166900, :name => "体育社会学系"},
        {:id => 167000, :name => "体育科学研究所"},
        {:id => 167100, :name => "武术系"},
        {:id => 167200, :name => "竞技体育系"},
        {:id => 167300, :name => "经济管理学院"},
        {:id => 167400, :name => "继续教育学院"},
        {:id => 167500, :name => "运动技术学院"},
        {:id => 167600, :name => "运动科学学院"},
        {:id => 167700, :name => "附属竞技体育学校"},
        {:id => 167800, :name => "其它院系"}
      ],
      
      
      102800 => [
        {:id => 167900, :name => "上音附中"},
        {:id => 168000, :name => "作曲指挥系"},
        {:id => 168100, :name => "公共基础部"},
        {:id => 168200, :name => "声乐系"},
        {:id => 168300, :name => "民乐系"},
        {:id => 168400, :name => "现代器乐系"},
        {:id => 168500, :name => "管弦系"},
        {:id => 168600, :name => "艺术管理系"},
        {:id => 168700, :name => "钢琴系"},
        {:id => 168800, :name => "音乐剧系"},
        {:id => 168900, :name => "音乐学系"},
        {:id => 169000, :name => "音乐工程系"},
        {:id => 169100, :name => "音教系"},
        {:id => 169200, :name => "其它院系"}
      ],
      
      
      102900 => [
        {:id => 169300, :name => "上戏附中"},
        {:id => 169400, :name => "公共课教学部"},
        {:id => 169500, :name => "创意学院"},
        {:id => 169600, :name => "导演系"},
        {:id => 169700, :name => "戏剧文学系"},
        {:id => 169800, :name => "戏曲学院"},
        {:id => 169900, :name => "电视艺术学院"},
        {:id => 170000, :name => "研究生部"},
        {:id => 170100, :name => "继续教育学院"},
        {:id => 170200, :name => "舞台美术系"},
        {:id => 170300, :name => "舞蹈学院"},
        {:id => 170400, :name => "艺术管理系"},
        {:id => 170500, :name => "表演系"},
        {:id => 170600, :name => "附属戏曲学校"},
        {:id => 170700, :name => "附属舞蹈学校"},
        {:id => 170800, :name => "其它院系"}
      ],
      
      
      103000 => [
        {:id => 170900, :name => "人文学院"},
        {:id => 171000, :name => "光彪学院"},
        {:id => 171100, :name => "公共教育学院"},
        {:id => 171200, :name => "商学院"},
        {:id => 171300, :name => "外语学院"},
        {:id => 171400, :name => "管理学院"},
        {:id => 171500, :name => "胜祥商学院"},
        {:id => 171600, :name => "计算机与科学技术学院"},
        {:id => 171700, :name => "其它院系"}
      ],
      
      
      103100 => [
        {:id => 171800, :name => "人文学院"},
        {:id => 171900, :name => "信息科学技术学院"},
        {:id => 172000, :name => "刑事司法学院"},
        {:id => 172100, :name => "商学院"},
        {:id => 172200, :name => "国际法学院"},
        {:id => 172300, :name => "外语学院"},
        {:id => 172400, :name => "政治学与公共管理学院"},
        {:id => 172500, :name => "法律学院"},
        {:id => 172600, :name => "知识产权学院"},
        {:id => 172700, :name => "研究生教育院"},
        {:id => 172800, :name => "社会学系"},
        {:id => 172900, :name => "经济法学院"},
        {:id => 173000, :name => "继续教育学院"},
        {:id => 173100, :name => "其它院系"}
      ],
      
      
      103200 => [
        {:id => 173200, :name => "外语系"},
        {:id => 173300, :name => "经管系"},
        {:id => 173400, :name => "其它院系"}
      ],
      
      
      103300 => [
        {:id => 173500, :name => "其它院系"}
      ],
      
      
      103400 => [
        {:id => 173600, :name => "日语"},
        {:id => 173700, :name => "机械系"},
        {:id => 173800, :name => "经管系"},
        {:id => 173900, :name => "艺术系"},
        {:id => 174000, :name => "英语"},
        {:id => 174100, :name => "计算机"},
        {:id => 174200, :name => "其它院系"}
      ],
      
      
      103500 => [
        {:id => 174300, :name => "其它院系"}
      ],
      
      
      103600 => [
        {:id => 174400, :name => "其它院系"}
      ],
      
      
      103700 => [
        {:id => 174500, :name => "传达设计学院"},
        {:id => 174600, :name => "数码传媒学院"},
        {:id => 174700, :name => "时尚设计学院"},
        {:id => 174800, :name => "空间与工业设计学院"},
        {:id => 174900, :name => "美术学院"},
        {:id => 175000, :name => "表演艺术学院"},
        {:id => 175100, :name => "其它院系"}
      ],
      
      
      103800 => [
        {:id => 175200, :name => "临床医学（五年制）"},
        {:id => 175300, :name => "临床医学（八年制）"},
        {:id => 175400, :name => "基础医学"},
        {:id => 175500, :name => "护理学院"},
        {:id => 175600, :name => "法医学"},
        {:id => 175700, :name => "其它院系"}
      ],
      
      
      103900 => [
        {:id => 175800, :name => "保险系"},
        {:id => 175900, :name => "国际经济与贸易"},
        {:id => 176000, :name => "新闻系"},
        {:id => 176100, :name => "经济系"},
        {:id => 176200, :name => "金融学"},
        {:id => 176300, :name => "金融服务系"},
        {:id => 176400, :name => "金融管理系"},
        {:id => 176500, :name => "其它院系"}
      ],
      
      
      104000 => [
        {:id => 176600, :name => "国际交流学院"},
        {:id => 176700, :name => "外语学院"},
        {:id => 176800, :name => "数码学院"},
        {:id => 176900, :name => "旅游会展学院"},
        {:id => 177000, :name => "经济管理学院"},
        {:id => 177100, :name => "其它院系"}
      ],
      
      
      104100 => [
        {:id => 177200, :name => "其它院系"}
      ],
      
      
      104200 => [
        {:id => 177300, :name => "国际交流合作学院"},
        {:id => 177400, :name => "国际合作交流学院"},
        {:id => 177500, :name => "经济管理系"},
        {:id => 177600, :name => "其它院系"}
      ],
      
      
      104300 => [
        {:id => 177700, :name => "出版与传播系"},
        {:id => 177800, :name => "出版系"},
        {:id => 177900, :name => "印刷包装工程系"},
        {:id => 178000, :name => "印刷系"},
        {:id => 178100, :name => "印刷设备工程系"},
        {:id => 178200, :name => "艺术系"},
        {:id => 178300, :name => "其它院系"}
      ],
      
      
      104400 => [
        {:id => 178400, :name => "影视动画"},
        {:id => 178500, :name => "流行音乐学院"},
        {:id => 178600, :name => "编导"},
        {:id => 178700, :name => "表演系"},
        {:id => 178800, :name => "其它院系"}
      ],
      
      
      104500 => [
        {:id => 178900, :name => "机电系"},
        {:id => 179000, :name => "电子工程"},
        {:id => 179100, :name => "经济管理系"},
        {:id => 179200, :name => "计算机"},
        {:id => 179300, :name => "其它院系"}
      ],
      
      
      104600 => [
        {:id => 179400, :name => "人文科学"},
        {:id => 179500, :name => "信息工程系"},
        {:id => 179600, :name => "应用艺术系"},
        {:id => 179700, :name => "经管一系"},
        {:id => 179800, :name => "经管二系"},
        {:id => 179900, :name => "航空运输系"},
        {:id => 180000, :name => "其它院系"}
      ],
      
      
      104700 => [
        {:id => 180100, :name => "人文艺术系"},
        {:id => 180200, :name => "公共管理系"},
        {:id => 180300, :name => "经济管理系"},
        {:id => 180400, :name => "其它院系"}
      ],
      
      
      104800 => [
        {:id => 180500, :name => "商务系"},
        {:id => 180600, :name => "德语系"},
        {:id => 180700, :name => "文法系"},
        {:id => 180800, :name => "日语系"},
        {:id => 180900, :name => "机电系"},
        {:id => 181000, :name => "法语系"},
        {:id => 181100, :name => "英语系"},
        {:id => 181200, :name => "计算机系"},
        {:id => 181300, :name => "韩语系"},
        {:id => 181400, :name => "其它院系"}
      ],
      
      
      104900 => [
        {:id => 181500, :name => "工艺美术系"},
        {:id => 181600, :name => "数码系"},
        {:id => 181700, :name => "环境艺术系"},
        {:id => 181800, :name => "视觉传达系"},
        {:id => 181900, :name => "其它院系"}
      ],
      
      
      105000 => [
        {:id => 182000, :name => "其它院系"}
      ],
      
      
      105100 => [
        {:id => 182100, :name => "外语系"},
        {:id => 182200, :name => "法律系"},
        {:id => 182300, :name => "管理系"},
        {:id => 182400, :name => "经济系"},
        {:id => 182500, :name => "其它院系"}
      ],
      
      
      105200 => [
        {:id => 182600, :name => "交通运输"},
        {:id => 182700, :name => "信息工程学院"},
        {:id => 182800, :name => "商船学院"},
        {:id => 182900, :name => "外语系"},
        {:id => 183000, :name => "机电工程系"},
        {:id => 183100, :name => "物流工程学院"},
        {:id => 183200, :name => "管理系"},
        {:id => 183300, :name => "经济管理学院"},
        {:id => 183400, :name => "航海技术系"},
        {:id => 183500, :name => "其它院系"}
      ],
      
      
      105300 => [
        {:id => 183600, :name => "建筑系"},
        {:id => 183700, :name => "护理系"},
        {:id => 183800, :name => "经管系"},
        {:id => 183900, :name => "其它院系"}
      ],
      
      
      105400 => [
        {:id => 184000, :name => "土木系"},
        {:id => 184100, :name => "外语系"},
        {:id => 184200, :name => "电子工程系"},
        {:id => 184300, :name => "管理系"},
        {:id => 184400, :name => "艺术系"},
        {:id => 184500, :name => "其它院系"}
      ],
      
      
      105500 => [
        {:id => 184600, :name => "汽车工程系"},
        {:id => 184700, :name => "经济管理系"},
        {:id => 184800, :name => "航空机电系"},
        {:id => 184900, :name => "轨道交通"},
        {:id => 185000, :name => "其它院系"}
      ],
      
      
      105600 => [
        {:id => 185100, :name => "上海科技学院"},
        {:id => 185200, :name => "其它院系"}
      ],
      
      
      105700 => [
        {:id => 185300, :name => "国际商务"},
        {:id => 185400, :name => "护理"},
        {:id => 185500, :name => "航运物流系"},
        {:id => 185600, :name => "其它院系"}
      ],
      
      
      105800 => [
        {:id => 185700, :name => "旅游日语"},
        {:id => 185800, :name => "旅游管理"},
        {:id => 185900, :name => "旅游英语"},
        {:id => 186000, :name => "酒店管理系"},
        {:id => 186100, :name => "其它院系"}
      ],
      
      
      105900 => [
        {:id => 186200, :name => "国航"},
        {:id => 186300, :name => "其它院系"}
      ],
      
      
      106000 => [
        {:id => 186400, :name => "动科系"},
        {:id => 186500, :name => "商旅系"},
        {:id => 186600, :name => "应用外语系"},
        {:id => 186700, :name => "植科系"},
        {:id => 186800, :name => "计算机"},
        {:id => 186900, :name => "其它院系"}
      ],
      
      
      106100 => [
        {:id => 187000, :name => "护理"},
        {:id => 187100, :name => "其它院系"}
      ],
      
      
      106200 => [
        {:id => 187200, :name => "信息与控制工程学院"},
        {:id => 187300, :name => "华世影视艺术学院"},
        {:id => 187400, :name => "卫生技术与护理学院"},
        {:id => 187500, :name => "国际商务与管理学院"},
        {:id => 187600, :name => "外语学院"},
        {:id => 187700, :name => "孔祥东音乐艺术学院"},
        {:id => 187800, :name => "报关与国际货运"},
        {:id => 187900, :name => "机电工程学院"},
        {:id => 188000, :name => "材料工程学院"},
        {:id => 188100, :name => "汽车工程学院"},
        {:id => 188200, :name => "美术设计学院"},
        {:id => 188300, :name => "其它院系"}
      ],
      
      
      106300 => [
        {:id => 188400, :name => "信息管理学院"},
        {:id => 188500, :name => "外语系"},
        {:id => 188600, :name => "电子与自动化系"},
        {:id => 188700, :name => "经贸与管理系"},
        {:id => 188800, :name => "继续教育学院"},
        {:id => 188900, :name => "计算机科学系"},
        {:id => 189000, :name => "软件学院"},
        {:id => 189100, :name => "其它院系"}
      ],
      
      
      106400 => [
        {:id => 189200, :name => "应用外语与法律系"},
        {:id => 189300, :name => "汽车数控系"},
        {:id => 189400, :name => "经贸管理系"},
        {:id => 189500, :name => "计算机"},
        {:id => 189600, :name => "其它院系"}
      ],
      
      
      106500 => [
        {:id => 189700, :name => "人文系"},
        {:id => 189800, :name => "学前教育"},
        {:id => 189900, :name => "经管系"},
        {:id => 190000, :name => "计算机系"},
        {:id => 190100, :name => "其它院系"}
      ],
      
      
      106600 => [
        {:id => 190200, :name => "医学影像设备系"},
        {:id => 190300, :name => "医械系"},
        {:id => 190400, :name => "医电系"},
        {:id => 190500, :name => "医疗器械与食品学院"},
        {:id => 190600, :name => "管理系"},
        {:id => 190700, :name => "其它院系"}
      ],
      
      
      106700 => [
        {:id => 190800, :name => "口腔技术系"},
        {:id => 190900, :name => "国际交流学院"},
        {:id => 191000, :name => "基础部"},
        {:id => 191100, :name => "技术检验系"},
        {:id => 191200, :name => "护理系"},
        {:id => 191300, :name => "眼视光技术系"},
        {:id => 191400, :name => "药学系"},
        {:id => 191500, :name => "其它院系"}
      ],
      
      
      106800 => [
        {:id => 191600, :name => "国际商务"},
        {:id => 191700, :name => "外语系"},
        {:id => 191800, :name => "新闻与传播"},
        {:id => 191900, :name => "其它院系"}
      ],
      
      
      106900 => [
        {:id => 192000, :name => "中华学院"},
        {:id => 192100, :name => "机电一体化"},
        {:id => 192200, :name => "模具设计与制造"},
        {:id => 192300, :name => "物流管理"},
        {:id => 192400, :name => "环境"},
        {:id => 192500, :name => "电气自动化"},
        {:id => 192600, :name => "营销与策划"},
        {:id => 192700, :name => "其它院系"}
      ],
      
      
      107000 => [
        {:id => 192800, :name => "外语系"},
        {:id => 192900, :name => "应用技术系"},
        {:id => 193000, :name => "管理系"},
        {:id => 193100, :name => "经济系"},
        {:id => 193200, :name => "艺术系"},
        {:id => 193300, :name => "其它院系"}
      ],
      
      
      107100 => [
        {:id => 193400, :name => "会计(注册会计师)专业"},
        {:id => 193500, :name => "商务英语"},
        {:id => 193600, :name => "市场营销专业"},
        {:id => 193700, :name => "文秘专业"},
        {:id => 193800, :name => "服装设计专业"},
        {:id => 193900, :name => "物流管理"},
        {:id => 194000, :name => "电子商务专业"},
        {:id => 194100, :name => "其它院系"}
      ]
    }
  end
  
end
