class CorporationIndustry < HashModel::Simple
  
  def self.data
    # [
    #   {:id => industry_id, :name => industry_name}
    # ]
    
    [
      {:id => 10, :name => "计算机软件"},
      {:id => 20, :name => "计算机硬件"},
      {:id => 30, :name => "互联网/电子商务"},
      {:id => 40, :name => "电子/微电子"},
      {:id => 50, :name => "通信(设备/运营/增值服务)"},
      {:id => 60, :name => "广告/会展/公关"},
      {:id => 70, :name => "房地产开发/建筑与工程"},
      {:id => 80, :name => "物业管理/商业中心"},
      {:id => 90, :name => "家居/室内设计/装潢"},
      {:id => 100, :name => "中介服务(人才/商标专利)"},
      {:id => 110, :name => "专业服务(咨询/财会/法律等)"},
      {:id => 120, :name => "金融业(投资/保险/证券/银行/基金)"},
      {:id => 130, :name => "贸易/进出口"},
      {:id => 140, :name => "媒体/出版/文化传播"},
      {:id => 150, :name => "印刷/包装/造纸"},
      {:id => 160, :name => "快速消费品(食品/饮料/日化/烟酒等)"},
      {:id => 170, :name => "耐用消费品(服饰/纺织/家具)"},
      {:id => 180, :name => "家电业"},
      {:id => 190, :name => "办公设备/用品"},
      {:id => 200, :name => "旅游/酒店/餐饮服务"},
      {:id => 210, :name => "批发/零售"},
      {:id => 220, :name => "交通/运输/物流"},
      {:id => 230, :name => "娱乐/运动/休闲"},
      {:id => 240, :name => "制药/生物工程"},
      {:id => 250, :name => "医疗/保健/美容/卫生服务"},
      {:id => 260, :name => "医疗设备/器械"},
      {:id => 270, :name => "环保"},
      {:id => 280, :name => "石油/化工/采掘/冶炼/原材料"},
      {:id => 290, :name => "能源(电力/石油)/水利"},
      {:id => 300, :name => "仪器/仪表/工业自动化/电气"},
      {:id => 310, :name => "汽车/摩托车(制造/维护/配件/销售/服务)"},
      {:id => 320, :name => "机械制造/机电/重工"},
      {:id => 330, :name => "原材料及加工(金属/木材/橡胶/塑料/玻璃/陶瓷/建材)"},
      {:id => 340, :name => "服务业"},
      {:id => 350, :name => "农/林/牧/渔"},
      {:id => 360, :name => "航空/航天研究与制造"},
      {:id => 370, :name => "教育/培训/科研/院校"},
      {:id => 380, :name => "政府/非营利机构"},
      {:id => 390, :name => "其他"}
    ]
  end
  
end
