class Industry < HashModel::Grouped
  
  def self.data
    {
      10 => [
        {:id => 10, :name => "计算机软件"},
        {:id => 20, :name => "计算机硬件"},
        {:id => 30, :name => "计算机服务（系统、数据服务，维修）"},
        {:id => 40, :name => "通信/电信/网络设备"},
        {:id => 50, :name => "电信/电信运营、增值服务"},
        {:id => 60, :name => "互联网/电子商务"},
        {:id => 70, :name => "网络游戏"},
        {:id => 80, :name => "电子技术/半导体/集成电路"},
        {:id => 90, :name => "仪器仪表/工业自动化"}
      ],
      
      20 => [
        {:id => 100, :name => "会计/审计"},
        {:id => 110, :name => "金融/证券/投资"},
        {:id => 120, :name => "银行"},
        {:id => 130, :name => "保险"}
      ],
      
      30 => [
        {:id => 140, :name => "贸易/进出口"},
        {:id => 150, :name => "批发/零售"},
        {:id => 160, :name => "快速消费品（食品、饮料、化妆品）"},
        {:id => 170, :name => "服装/纺织/皮革"},
        {:id => 180, :name => "家具/家电/工艺品/玩具/珠宝"},
        {:id => 190, :name => "办公用品及设备"},
        {:id => 200, :name => "机械/设备/重工"},
        {:id => 210, :name => "汽车及零配件"}
      ],
      
      40 => [
        {:id => 220, :name => "制药/生物工程"},
        {:id => 230, :name => "医疗/护理/保健/卫生"},
        {:id => 240, :name => "医疗设备/器械"}
      ],
      
      50 => [
        {:id => 250, :name => "广告"},
        {:id => 260, :name => "公关/市场推广/会展"},
        {:id => 270, :name => "影视/媒体/艺术"},
        {:id => 280, :name => "文字媒体/出版"},
        {:id => 290, :name => "印刷/包装/造纸"}
      ],
      
      60 => [
        {:id => 300, :name => "房地产开发"},
        {:id => 310, :name => "建筑/建材/工程"},
        {:id => 320, :name => "家居/室内设计/装潢"},
        {:id => 330, :name => "物业管理/商业中心"}
      ],
      
      70 => [
        {:id => 340, :name => "中介服务"},
        {:id => 350, :name => "咨询/人力资源"},
        {:id => 360, :name => "外包服务"},
        {:id => 370, :name => "检测，认证"},
        {:id => 380, :name => "法律"},
        {:id => 390, :name => "教育/培训"},
        {:id => 400, :name => "学术/科研"}
      ],
      
      80 => [
        {:id => 410, :name => "餐饮业"},
        {:id => 420, :name => "酒店/旅游"},
        {:id => 430, :name => "娱乐/休闲/体育"},
        {:id => 440, :name => "美容/保健"},
        {:id => 450, :name => "生活服务"}
      ],
      
      90 => [
        {:id => 460, :name => "交通/运输/物流"},
        {:id => 470, :name => "航天/航空"},
      ],
      
      100 => [
        {:id => 480, :name => "石油/化工/矿产/地质"},
        {:id => 490, :name => "采掘业/冶炼"},
        {:id => 500, :name => "电力/水利"},
        {:id => 510, :name => "原材料和加工"}
      ],
      
      110 => [
        {:id => 520, :name => "政府"},
        {:id => 530, :name => "非盈利机构"},
        {:id => 540, :name => "环保"},
        {:id => 550, :name => "农业/渔业/林业"},
        {:id => 560, :name => "多元化业务集团公司"}
      ]
    }
  end
  
end
