class JobMajor < HashModel::Simple
  
  def self.data
    [
      {:id => 10, :name => "经管类(金融/营销/HR/财务/物流/行政)"},
      {:id => 20, :name => "电子信息类(计算机/电气/通信/软件)"},
      {:id => 30, :name => "机械动力类(航空/汽车/船舶)"},
      {:id => 40, :name => "建筑工程类(建筑/土木)"},
      {:id => 45, :name => "农业生物类(园林/食品/材料/环境)"},
      {:id => 50, :name => "医药化工类(化学/化工/药学)"},
      {:id => 60, :name => "基础科学类(数学/物理)"},
      {:id => 65, :name => "新闻类(广告/公关/出版)"},
      {:id => 70, :name => "人文类(历史/地理/哲学/社会/心理)"},
      {:id => 72, :name => "语言类(英语/日语/西班牙语)"},
      {:id => 74, :name => "艺术类(媒体设计)"},
      {:id => 76, :name => "服务类(空乘/社工等)"},
      {:id => 78, :name => "医学类(临床/护理/卫生)"},
      {:id => 80, :name => "法律类"},
      {:id => 90, :name => "教育类"},
      {:id => 100, :name => "体育类"}
    ]
  end
  
end
