class Industry < HashModel::Grouped
  
  def self.data
    {
      10 => [
        {:id => 10, :name => "硬件开发"},
        {:id => 20, :name => "软件开发"},
        {:id => 30, :name => "品管、技术支持及其他"},
        {:id => 40, :name => "通信技术"}
      ],
      
      20 => [
        {:id => 50, :name => "销售管理"},
        {:id => 60, :name => "销售人员"},
        {:id => 70, :name => "销售行政及商务"},
        {:id => 80, :name => "客服及技术支持"}
      ],
      
      30 => [
        {:id => 90, :name => "技术工人"},
        {:id => 100, :name => "生产、营运"},
        {:id => 110, :name => "质量、安检"},
        {:id => 120, :name => "工程"},
        {:id => 130, :name => "采购"},
        {:id => 140, :name => "贸易"},
        {:id => 150, :name => "物流、仓储"}
      ],
      
      40 => [
        {:id => 160, :name => "咨询、顾问"},
        {:id => 170, :name => "科研人员"},
        {:id => 180, :name => "研究员"},
        {:id => 190, :name => "教师"},
        {:id => 200, :name => "律师"},
        {:id => 210, :name => "翻译"},
        {:id => 220, :name => "写作"}
      ],
      
      50 => [
        {:id => 230, :name => "会计"},
        {:id => 240, :name => "审计"},
        {:id => 250, :name => "税务"}
      ],
      
      60 => [
        {:id => 260, :name => "人力资源"},
        {:id => 270, :name => "行政、后勤"}
      ],
      
      70 => [
        {:id => 280, :name => "餐饮、娱乐"},
        {:id => 290, :name => "大堂经理"},
        {:id => 300, :name => "导游"},
        {:id => 310, :name => "保安"},
        {:id => 320, :name => "交通运输服务"},
        {:id => 330, :name => "零售服务"},
        {:id => 340, :name => "家政服务"},
        {:id => 350, :name => "环保"},
        {:id => 360, :name => "其他服务"}
      ],
      
      80 => [
        {:id => 370, :name => "公务员"},
        {:id => 380, :name => "储备干部、管理培训生"}
      ]
    }
  end
  
end
